Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: To add a custom package variant of the ``${PN}`` recipe named ``${PN}-extra`` (name is arbitrary), one can add it to the :term:`PACKAGE_BEFORE_PN` variable::
it_it: Per aggiungere una variante di pacchetto personalizzata della ricetta ``${PN}`` denominata ``${PN}-extra`` (il nome è arbitrario), è possibile aggiungerla alla variabile :term:`PACKAGE_BEFORE_PN`::

source: To again disable the ``kmalloc`` event, we need to send ``0`` to the ``enable`` file::
it_it: Per disabilitare nuovamente l'evento ``kmalloc``, dobbiamo inviare ``0`` al file ``enable``::

source: To avoid the need of ``sudo`` privileges, the ``install-buildtools`` script will by default tell the installer to install in::
it_it: Per evitare la necessità di privilegi ``sudo``, lo script ``install-buildtools`` , per default, indicherà al programma di installazione di installare i pacchetti nella directory::

source: To build an image such as ``core-image-sato`` for the ``qemux86-64`` machine, you need a system with at least 140 Gbytes of free disk space. However, much more disk space will be necessary to build more complex images, to run multiple builds and to cache build artifacts, improving build efficiency.
it_it: Per creare un'immagine come ``core-image-sato`` per la macchina ``qemux86-64``, è necessario un sistema con almeno 140 GB di spazio libero su disco. Tuttavia, sarà necessario molto più spazio su disco per creare immagini più complesse, per eseguire più build e per memorizzare nella cache gli artefatti di build, migliorando l'efficienza del processo.

source: To complicate the problem, there are things that should not be included in the checksum. First, there is the actual specific build path of a given task --- the :term:`WORKDIR`. It does not matter if the work directory changes because it should not affect the output for target packages. Also, the build process has the objective of making native or cross packages relocatable.
it_it: A complicare il problema, ci sono elementi che non dovrebbero essere inclusi nel checksum. Innanzitutto, c'è il path di compilazione specifico di un dato task, ovvero la :term:`WORKDIR`. Non importa se la directory di lavoro cambia perché non dovrebbe influire sull'output dei pacchetti target. Inoltre, il processo di compilazione ha l'obiettivo di rendere i pacchetti nativi o cross-rilocabili.

source: To create the read-only root filesystem, simply add the "read-only-rootfs" feature to your image, normally in one of two ways. The first way is to add the "read-only-rootfs" image feature in the image's recipe file via the :term:`IMAGE_FEATURES` variable::
it_it: Per creare il filesystem root di sola lettura, è sufficiente aggiungere la funzionalità "read-only-rootfs" all'immagine, solitamente in uno dei due modi seguenti. Il primo metodo consiste nell'aggiungere la funzionalità "read-only-rootfs" al file di configurazione dell'immagine tramite la variabile :term:`IMAGE_FEATURES`::

source: To demonstrate this, open up one window and start the profile using the ``-a`` flag (press ``Ctrl-C`` to stop tracing)::
it_it: Per dimostrarlo, aprire una finestra e avviare il profilo utilizzando il flag ``-a`` (premere ``Ctrl-C`` per interrompere il tracing)::

source: To determine if a task needs to be rerun, BitBake checks if a stamp file with a matching input checksum exists for the task. In this case, the task's output is assumed to exist and still be valid. Otherwise, the task is rerun.
it_it: Per determinare se un task deve essere rieseguita, BitBake verifica se esiste un file di stamp con un checksum di input corrispondente per il task. In tal caso, si presume che l'output del task esista e sia ancora valido. Altrimenti, il task viene rieseguito.

source: To determine the correct checksum string, you can list the appropriate files in the :term:`LIC_FILES_CHKSUM` variable with incorrect md5 strings, attempt to build the software, and then note the resulting error messages that will report the correct md5 strings. See the ":ref:`dev-manual/new-recipe:fetching code`" section for additional information.
it_it: Per determinare la stringa di checksum corretta, è possibile elencare i file appropriati nella variabile :term:`LIC_FILES_CHKSUM` con stringhe MD5 errate, provare a compilare il software e quindi annotare i messaggi di errore risultanti che indicheranno le stringhe MD5 corrette. Consultare la sezione ":ref:`dev-manual/new-recipe:fetching code`" per ulteriori informazioni.

source: To dive down into a next level of detail, we can use ``perf record`` / ``perf report`` which will collect profiling data and present it to use using an interactive text-based UI (or just as text if we specify ``--stdio`` to ``perf report``).
it_it: Per approfondire ulteriormente, possiamo utilizzare ``perf record`` / ``perf report``, che raccolgono i dati di profilazione e li presentano tramite un'interfaccia utente interattiva basata su testo (oppure semplicemente come testo se specifichiamo ``--stdio`` a ``perf report``).

source: To do system-wide profiling or tracing, you typically use the ``-a`` flag to ``perf record``.
it_it: Per eseguire il tracciamento o la profilazione a livello di sistema, si utilizza in genere l'opzione ``-a`` con ``perf record``.

source: To enable a check for CVE security vulnerabilities in the specific image or target you are building, run the following command from your :term:`Build Directory`:
it_it: Per abilitare la verifica delle vulnerabilità di sicurezza CVE nell'immagine o nel target specifico che si sta compilando, eseguire il seguente comando dalla propria :term:`Build Directory`:

source: To enable tracing for a given device, use ``/sys/block/xxx/trace/enable``, where ``xxx`` is the device name. This for example enables tracing for ``/dev/sdc``::
it_it: Per abilitare il tracing per un determinato dispositivo, utilizzare il comando ``/sys/block/xxx/trace/enable``, dove ``xxx`` è il nome del dispositivo. Ad esempio, questo abilita il tracciamento per ``/dev/sdc``::

source: To ensure that the dependency chain is never broken, ``-dev`` and ``-dbg`` packages are always generated by default, even if the packages turn out to be empty. See the :term:`ALLOW_EMPTY` variable for more information.
it_it: Per garantire che la catena di dipendenze non venga mai interrotta, i pacchetti ``-dev`` e ``-dbg`` vengono sempre generati per default, anche se risultano vuoti. Per ulteriori informazioni, consultare la variabile :term:`ALLOW_EMPTY`.

source: To find a suitable prefix for the commit summary, a good idea is to look for prefixes used in previous commits touching the same files or directories::
it_it: Per trovare un prefisso adatto per il riepilogo del commit, un buon consiglio è quello di cercare i prefissi utilizzati nei commit precedenti che hanno interessato gli stessi file o directory::

source: To find out which package installs a file, the ``oe-pkgdata-util`` command-line utility can be used::
it_it: Per scoprire quale pacchetto installa un file, è possibile utilizzare l'utilità da riga di comando ``oe-pkgdata-util``::

source: To generate debug info for packages, you can add ``dbg-pkgs`` to :term:`EXTRA_IMAGE_FEATURES` in :ref:`structure-build-conf-local.conf`. For example::
it_it: Per generare informazioni di debug per i pacchetti, è possibile aggiungere ``dbg-pkgs`` a :term:`EXTRA_IMAGE_FEATURES` nel file :ref:`structure-build-conf-local.conf`. Ad esempio::

source: To generate the debug info for the packages in the image, we can add ``dbg-pkgs`` to :term:`EXTRA_IMAGE_FEATURES` in :ref:`structure-build-conf-local.conf`. For example::
it_it: Per generare le informazioni di debug per i pacchetti nell'immagine, possiamo aggiungere ``dbg-pkgs`` a :term:`EXTRA_IMAGE_FEATURES` in :ref:`structure-build-conf-local.conf`. Ad esempio::

source: To handle all these complexities, BitBake runs in two phases. The first is the "setscene" stage. During this stage, BitBake first checks the sstate cache for any targets it is planning to build. BitBake does a fast check to see if the object exists rather than doing a complete download. If nothing exists, the second phase, which is the setscene stage, completes and the main build proceeds.
it_it: Per gestire tutte queste complessità, BitBake viene eseguito in due fasi. La prima è la fase "setscene" [ndt: Prima Fase (Fase di Setscene / Valutazione Cache]. Durante questa fase, BitBake verifica innanzitutto nella cache di sstate la presenza di eventuali target che intende compilare. BitBake esegue un controllo rapido per verificare se l'oggetto esiste, anziché scaricarlo completamente. Se non viene trovato nulla, la seconda fase, ovvero la fase setscene [ndt: Seconda Fase (Fase di Run / Compilazione Reale)], viene completata e la compilazione principale procede.

source: To have blktrace operate in this mode, start blktrace in server mode on the host system, which is going to store the captured data::
it_it: Per far funzionare blktrace in questa modalità, si avvia blktrace in modalità server sul sistema host, che memorizzerà i dati acquisiti::

source: To have the perf manual pages installed on your target, modify your configuration as follows::
it_it: Per installare le pagine del manuale di perf sul sistema target, modificare la configurazione come segue:

source: To help understand the BSP layer concept, consider the BSPs that the Yocto Project supports and provides with each release. You can see the layers in the :ref:`overview-manual/development-environment:yocto project source repositories` through a web interface at :yocto_git:`/`. If you go to that interface, you will find a list of repositories under "Yocto Metadata Layers".
it_it: Per comprendere meglio il concetto di layer BSP, si considerino i BSP supportati e forniti da Yocto Project in ogni release. È possibile visualizzare i layer nei repository sorgente di Yocto Project (vedere :ref:`overview-manual/development-environment:yocto project source repositories`) tramite un'interfaccia web all'indirizzo :yocto_git:`/`. Accedendo a quell'interfaccia, si troverà un elenco di repository sotto la voce "Yocto Metadata Layers".

source: To illustrate how layers are used to keep things modular, consider machine customizations. These types of customizations typically reside in a special layer, rather than a general layer, called a BSP Layer. Furthermore, the machine customizations should be isolated from recipes and Metadata that support a new GUI environment, for example. This situation gives you a couple of layers: one for the machine configurations, and one for the GUI environment. It is important to understand, however, that the BSP layer can still make machine-specific additions to recipes within the GUI environment layer without polluting the GUI layer itself with those machine-specific changes. You can accomplish this through a recipe that is a BitBake append (``.bbappend``) file, which is described later in this section.
it_it: Per illustrare come i layer vengano utilizzati per mantenere la modularità, consideriamo le personalizzazioni della macchina. Questo tipo di personalizzazioni risiede in genere in un layer speciale, anziché in uno generale, chiamato BSP Layer. Inoltre, le personalizzazioni della macchina dovrebbero essere isolate dalle ricette e dai metadati che supportano un nuovo ambiente GUI, ad esempio. Questa situazione crea un paio di layer: uno per le configurazioni della macchina e uno per l'ambiente GUI. È importante comprendere, tuttavia, che il layer BSP può comunque aggiungere modifiche specifiche della macchina alle ricette all'interno del layer dell'ambiente GUI senza inquinare il layer GUI stesso con tali modifiche specifiche della macchina. È possibile ottenere questo risultato tramite una ricetta che è un file di append BitBake (``.bbappend``), descritto più avanti in questa sezione.

source: To illustrate the string substitutions, here are the corresponding statements from the Raspberry Pi ``conf/layer.conf`` file::
it_it: Per illustrare le sostituzioni di stringhe, ecco le corrispondenti istruzioni dal file ``conf/layer.conf`` del Raspberry Pi::

source: To include all staged files::
it_it: Per includere tutti i file aggiunti all'area di staging::

source: To keep track of such equivalence, BitBake has to manage three hashes for each task:
it_it: Per tenere traccia di tale equivalenza, BitBake deve gestire tre hash per ogni task:

source: To learn how to use Clang for the SDK, see :term:`PREFERRED_TOOLCHAIN_SDK`.
it_it: Per informazioni su come utilizzare Clang per l'SDK, consultare :term:`PREFERRED_TOOLCHAIN_SDK`.

source: To make sure shared state verification is working, you can set a "fake" public key identifier in :term:`SSTATE_VALID_SIGS`::
it_it: Per verificare che la verifica dello shared state funzioni correttamente, è possibile impostare un identificatore di chiave pubblica "fake" in :term:`SSTATE_VALID_SIGS`::

source: To make sure the shared state artifact was successfully used, look for the :ref:`setscene <overview-manual/concepts:setscene tasks and shared state>` task for ``create_recipe_spdx`` in the latest log file from :term:`BitBake`:
it_it: Per assicurarci che l'artefatto dello shared state sia stato utilizzato correttamente, cerchiamo il task :ref:`setscene <overview-manual/concepts:setscene tasks and shared state>` per ``create_recipe_spdx`` nell'ultimo file di log di :term:`BitBake`:

source: To record a trace, just run the ``blktrace`` command, giving it the name of the block device you want to trace activity on::
it_it: Per registrare una traccia, è sufficiente eseguire il comando ``blktrace``, specificando il nome del dispositivo a blocchi su cui si desidera tracciare l'attività::

source: To report any inaccuracies or problems with this (or any other Yocto Project) manual, or to send additions or changes, please send email/patches to the Yocto Project documentation mailing list at ``docs@lists.yoctoproject.org`` or log into the `Libera Chat <https://libera.chat/>`__ ``#yocto`` channel.
it_it: Per segnalare eventuali inesattezze o problemi con questo manuale (o con qualsiasi altro manuale di Yocto Project), o per inviare aggiunte o modifiche, si prega di inviare un'e-mail/patch alla mailing list della documentazione di Yocto Project all'indirizzo ``docs@lists.yoctoproject.org`` o di accedere su `Libera Chat <https://libera.chat/>`__ al canale ``#yocto``.

source: To see a list of the options BitBake supports, use either of the following commands::
it_it: Per visualizzare un elenco delle opzioni supportate da BitBake, utilizzare uno dei seguenti comandi:

source: To see the available branch names in a cloned repository, use the ``git branch -a`` command.
it_it: Per visualizzare i nomi dei branch disponibili in un repository clonato, si usa il comando ``git branch -a``.

source: To see the results in a "text-based UI" (tui), just run ``perf report``, which will read the perf.data file in the current working directory and display the results in an interactive UI::
it_it: Per visualizzare i risultati in un'interfaccia utente testuale (tui), è sufficiente eseguire ``perf report``, che leggerà il file perf.data nella directory di lavoro corrente e visualizzerà i risultati in un'interfaccia utente interattiva::

source: To set the right mailing list address for a given repository::
it_it: Per impostare l'indirizzo corretto della mailing list per un determinato repository::

source: To set up passwords, use the :ref:`ref-classes-extrausers` class, which is the preferred method. For an example on how to set up both root and user passwords, see the ":ref:`ref-classes-extrausers`" section.
it_it: Per impostare le password, utilizzare la classe :ref:`ref-classes-extrausers`, che è il metodo consigliato. Per un esempio su come impostare le password di root e degli utenti, consultare la sezione ":ref:`ref-classes-extrausers`".

source: To specify ``bash`` 3.2.48 as the version to build, enter "PREFERRED_VERSION_bash" in the "Variable" field, and "3.2.48" in the "Value" field. Next, click the "Add variable" button:
it_it: Per specificare ``bash`` 3.2.48 come versione da compilare, inserire "PREFERRED_VERSION_bash" nel campo "Variable" e "3.2.48" nel campo "Value". Quindi, cliccare sul pulsante "Add variable":

source: To start a trace using KernelShark, first start this tool::
it_it: Per avviare una traccia con KernelShark, si avvia prima questo tool::

source: To start profiling the system, you just press the ``Start`` button. To stop profiling and to start viewing the profile data in one easy step, press the ``Profile`` button.
it_it: Per iniziare la profilazione del sistema, è sufficiente premere il pulsante ``Start``. Per interrompere la profilazione e visualizzare i dati di profilazione in un unico passaggio, premere il pulsante ``Profile``.

source: To start the default Toaster Django web server with the Toaster database now in Mysql, use the standard start commands::
it_it: Per avviare il server web Toaster Django di default con il database Toaster ora in MySQL, si usano i comandi di avvio standard::

source: To submit patches through email, it is very important that you send them without any whitespace or HTML formatting that either you or your mailer introduces. The maintainer that receives your patches needs to be able to save and apply them directly from your emails, using the ``git am`` command.
it_it: Per inviare patch via email, è fondamentale che non contengano spazi bianchi o formattazione HTML, né introdotti manualmente né dal client di posta. Il manutentore che riceve le patch deve essere in grado di salvarle e applicarle direttamente dalle email, utilizzando il comando ``git am``.

source: To summarize, when Hash Equivalence is enabled, a change in one of the tasks in BitBake's run queue doesn't have to propagate to all the downstream tasks that depend on the output of this task, causing a full rebuild of such tasks, and so on with the next depending tasks. Instead, when the output of this task remains identical to previously recorded output, BitBake can safely retrieve all the downstream task output from the Shared State cache.
it_it: In sintesi, quando l'Hash Equivalence è abilitata, una modifica in una dei task nella coda di esecuzione di BitBake non deve necessariamente propagarsi a tutti i task a valle che dipendono dall'output di tale task, causando una ricostruzione completa di questi task, e così via con i task dipendenti successive. Invece, quando l'output di questi task rimane identico all'output registrato in precedenza, BitBake può recuperare in modo sicuro l'output di tutti i task a valle dalla cache dello Shared State.

source: To this purpose, you should create *one Git commit per change*, corresponding to each of the patches you will eventually submit. See `further guidance <https://www.kernel.org/doc/html/latest/process/submitting-patches.html#separate-your-changes>`__ in the Linux kernel documentation if needed.
it_it: A questo scopo, si deve creare *un commit Git per ogni modifica*, corrispondente a ciascuna delle patch che si invierà. Consultare `ulteriori indicazioni <https://www.kernel.org/doc/html/latest/process/submitting-patches.html#separate-your-changes>`__ nella documentazione del kernel Linux, se necessario.

source: To understand how BitBake operates in the build directory and environment we can consider the following recipes and diagram, to have full picture about the tasks that BitBake runs to generate the final package file for the recipe.
it_it: Per comprendere il funzionamento di BitBake nella directory e nell'ambiente di build, possiamo considerare le seguenti ricette e il diagramma, per avere un quadro completo dei task che BitBake esegue per generare il file di pacchetto finale per la ricetta.

source: To use an include file, you simply include them in the machine configuration file. For example, the Raspberry Pi BSP ``raspberrypi3.conf`` contains the following statement::
it_it: Per utilizzare un file include, è sufficiente includerlo nel file di configurazione della macchina. Ad esempio, il file ``raspberrypi3.conf`` del BSP del Raspberry Pi contiene la seguente istruzione::

source: To use such mirrors, enable the :ref:`ref-fragments-core-yocto-sstate-mirror-cdn` fragment::
it_it: Per utilizzare tali mirror, abilitare il frammento :ref:`ref-fragments-core-yocto-sstate-mirror-cdn`::

source: To use the variable, list out the package's commands that are also provided by another package. For example, if the ``busybox`` package has four such commands, you identify them as follows::
it_it: Per utilizzare la variabile, elencare i comandi del pacchetto che sono presenti anche in un altro pacchetto. Ad esempio, se il pacchetto ``busybox`` ha quattro comandi di questo tipo, li identifichi come segue::

source: To use your own layer source, you need to set up the layer source and then tie it into Toaster. This section describes how to tie into a layer index in a manner similar to the way Toaster ties into the OpenEmbedded Metadata Index.
it_it: Per utilizzare la propria sorgente di layer, è necessario configurarla e quindi integrarla in Toaster. Questa sezione descrive come integrarsi con un indice di layer in modo simile a come Toaster si integra con l'OpenEmbedded Metadata Index.

source: To view the trace events, just call ``blkparse`` in the directory containing the trace files, giving it the device name that forms the first part of the filenames::
it_it: Per visualizzare gli eventi di traccia, è sufficiente richiamare ``blkparse`` nella directory contenente i file di traccia, specificando il nome del dispositivo che costituisce la prima parte del nome del file::

source: Toaster Features
it_it: Funzionalità di Toaster

source: Toaster Manual
it_it: Manuale di Toaster

source: Toaster User Manual
it_it: Manuale Utente di Toaster

source: Toaster Web Interface Videos
it_it: Video sull'Interfaccia Web di Toaster

source: Toaster allows you to configure and run builds, and it provides extensive information about the build process.
it_it: Toaster consente di configurare ed eseguire build e fornisce informazioni dettagliate sul processo di build.

source: Toaster also allows you to configure and run your builds from the command line, and switch between the command line and the web interface at any time. Builds started from the command line appear within a special Toaster project called "Command line builds".
it_it: Toaster consente inoltre di configurare ed eseguire le build [compilazioni] dalla riga di comando e di passare dalla riga di comando all'interfaccia web in qualsiasi momento. Le compilazioni avviate dalla riga di comando vengono visualizzate in un progetto Toaster speciale denominato "Command line builds" [Compilazioni da riga di comando].

source: Toaster as a hosted service is suited for multiple users developing across several build hosts. When Toaster is set up as a hosted service, its components can be spread across several machines:
it_it: Toaster come servizio condiviso è adatto a più utenti che sviluppano su diversi host di build. Quando Toaster è configurato come servizio condiviso [shared], i suoi componenti possono essere distribuiti su più macchine:

source: Toaster creates a :term:`Build Directory` within your Source Directory (e.g. ``poky``) to execute the builds.
it_it: Toaster crea una :term:`Build Directory` all'interno della Source Directory (ad esempio ``poky``) per eseguire le build.

source: Toaster creates a ``_toaster_clones`` directory inside your Source Directory (i.e. ``poky``) to clone any layers needed for your builds.
it_it: Toaster crea una directory ``_toaster_clones`` all'interno della Source Directory (ad esempio ``poky``) per clonare tutti i layer necessari per le build.
